Repository: abdullohalimov/HR_Agrozamin_bot
Catalog: tgbot/locales/*/LC_MESSAGES/hrbot.po
Languages: de, ru

source: Бош иш оринларини кориш ва тестлардан отиш учун озингиз хакингиздаги маълумотларни киритингишингиз керак. ✍🏼 Фамилия, Исм, Шарифни киритинг.
de: Bo'sh ish o'rinlarini ko'rish va testlardan o'tish uchun o'zingiz xaqingizdagi ma'lumotlarni kiritishingiz kerak ✍🏼 Familiya, Ism, Sharifingizni kiriting
ru: Чтобы увидеть вакансии и пройти тестирование вам нужно заполнить анкету ✍🏼 Введите Фамилия, Имя, Отчество

source: 🏡 Бош меню:
de: 🏡 Bosh menyu:
ru: 🏡 Главное меню:

source: Ёшингиз:
de: Yoshingiz:
ru: Ваш возраст:

source: Маълумотингиз:
de: Ma'lumotingiz:
ru: Ваше Образование

source: <em>Дастурлаш тилини танланг:</em>
ru: <em>Выберите язык программирования:</em>

source: Қўшимча билимларингиз: Бир нечтасини белгилашингиз мумкин Танланган: {data}
de: Qo'shimcha bilimlaringiz: Bir nechtasini belgilashingiz mumkin. Tanlangan: {data}
ru: Какие дополнительные навыки у вас есть? Можете выбрать несколько Выбрано: {data}

source: Хатолик! Бу телефон раками аввал ройхатдан отказилган Илтимос, анкетани кайта толдиринг!
de: Xatolik! Bu telefon raqami avval ro'yxatdan o'tkazilgan Iltimos, anketani qayta to'ldiring!
ru: Ошибка! Этот номер телефона уже зарегистрирован Пожалуйста, составьте анкету заново

source: Тилни танлаш
de: Tilni tanlash
ru: Выбрать язык

source: Жинсингиз:
de: Jinsingiz:
ru: Ваш пол:

source: Қўшимча билимларингиз: Бир нечтасини белгилашингиз мумкин:
de: Qo'shimcha bilimlaringiz: Bir nechtasini belgilashingiz mumkin:
ru: Дополнительные навыки: Можете выбрать несколько

source: Дастурлаш тили: {prog_lang} Кошимча билимлар: {extra_categories} 📰 Резюмеингизни юборинг: ❗️ Резюмелар фақат DOC, DOCX, PDF форматида қабул қилинади. Эътибор беринг, бир вакансияга бир маротаба резюме юборишингиз мумкин. Файл ҳажми 10 Мб дан ортмаслиги лозим.
de: Dasturlash tili: {prog_lang} Qo'shimcha bilimlar: {extra_categories} 📰 Rezyumeingizni yuboring: ❗️ Rezyumelar faqat DOC, DOCX, PDF formatida qabul qilinadi. E'tibor bering, bir vakansiyaga bir marotaba rezyume yuborishingiz mumkin. Fayl xajmi 10 MB dan ortmasligi lozim.
ru: Язык программирования: {prog_lang} Допольнительные знания: {extra_categories} 📰 Отправьте своё резюме: ❗️ Принимаются только резюме в формате DOC, DOCX, PDF. Обратите внимание, на одну вакансию можно отправить только одно резюме. Размер файла не должно превышать 10 MB.

source: Йок
de: Yo'q
ru: Нет

source: 🤖 Ҳурматли номзод «Тeстни бошлаш» тугмасини босиб тeстни бошлашингиз мумкин. 📚 Тeстлар сони {q_count} та. Тeстда {prog_lang} бойича саволлар бўлади. 🕘 {q_count} та саволга жами {time_count} дақиқа вақт бeрилади. ❗️ Тeстни бошлаганингиздан кeйин {time_count} дақиқа ичида тугатмасангиз тeст натижаси ҳисобланмайди. Омад ёр бўлсин !
de: 🤖 Hurmatli nomzod «Testni boshlash» tugmasini bosib testni boshlashingiz mumkin. 📚 Testlar soni {q_count} ta. Testda {prog_lang} bo'yicha savollar bo'ladi. 🕘 {q_count} ta savolga jami {time_count} daqiqa vaqt beriladi. ❗️ Testni boshlaganingizdan keyin {time_count} daqiqa ichida tugatmasangiz test natijasi xisoblanmaydi. Omad yor bo'lsin !
ru: 🤖 Уважаемый кандидат, нажимая кнопку «Начать тестирование» вы можете приступить к тестированию. 📚 Количество тестов {q_count}. В тестах вопросы будут по {prog_lang}. 🕘 На {q_count} вопросов будет отведено {time_count} минут времени. ❗️ Если после начала тестов не успеете закончить за {time_count} минут результаты теста не будут засчитаны Удачи !

source: 🤖 Ҳурматли номзод «Тeстни бошлаш» тугмасини босиб тeстни бошлашингиз мумкин. 📚 Тeстлар сони {q_count} та. Тeстда {extra_category} ва {prog_lang} бойича саволлар бўлади. 🕘 {q_count} та саволга жами {time_count} дақиқа вақт бeрилади. ❗️ Тeстни бошлаганингиздан кeйин {time_count} дақиқа ичида тугатмасангиз тeст натижаси ҳисобланмайди. Омад ёр бўлсин !
de: 🤖 Hurmatli nomzod «Testni boshlash» tugmasini bosib testni boshlashingiz mumkin. 📚 Testlar soni {q_count} ta. Testda {extra_category} va {prog_lang} bo'yicha savollar bo'ladi. 🕘 {q_count} ta savolga jami {time_count} daqiqa vaqt beriladi. ❗️ Testni boshlaganingizdan keyin {time_count} daqiqa ichida tugatmasangiz test natijasi xisoblanmaydi. Omad yor bo'lsin !
ru: 🤖 Уважаемый кандидат, нажимая кнопку «Начать тестирование» вы можете приступить к тестированию. 📚 Количество тестов {q_count}. В тестах вопросы будут по {extra_category} и {prog_lang}. 🕘 На {q_count} вопросов будет отведено {time_count} минут времени. ❗️ Если после начала тестов не успеете закончить за {time_count} минут результаты теста не будут засчитаны Удачи !

source: ⏳ Сизда қолган вақт: {min} min. {sec} sec.
de: ⏳ Sizda qolgan vaqt: {min} min. {sec} sec.
ru: ⏳ Оставшееся время: {min} min. {sec} sec.

source: Ажратилган вакт нихоясига етди, тест натижалари кабул килинмайди!
de: Ajratilgan vaqt nihoyasiga yetdi, test natijalari qabul qilinmaydi!
ru: Отведенное время подошло к концу, результат теста не будет засчитан!

source: ✅ Тест натижаси: ⏱ Кeтган вақт: {min} min. {sec} sec. 🔹 Асосий {prog_lang}: 🔹 Саволлар сони: {quest_count} 🔹 Тогри топилган жавоблар сони: {quest_true} 📈 % ---- {percent} %
ru: ✅ Результат тестирования: ⏱ Потраченное время: {min} min. {sec} sec. 🔹 Главная {prog_lang}: 🔹 Количество вопросов: {quest_count} 🔹 Количество правильных ответов: {quest_true} 📈 % ---- {percent} %

source: ✅ Тест натижаси: ⏱ Кeтган вақт: {min} min. {sec} sec. 🔹 Асосий {prog_lang}: 🔹 Саволлар сони: {quest_count} 🔹 Тогри топилган жавоблар сони: {quest_true} 🔹 {extra_cat} саволлар сони: {extra_quest_count} 🔹 Тогри топилган жавоблар сони: {extra_quest_true} 🔹 Умумий тогри топилган жавоблар сони: {all_true} 📈 % ---- {percent} %
ru: ✅ Результат тестирования: ⏱ Потраченное время: {min} min. {sec} sec. 🔹 Главная {prog_lang}: 🔹 Количество вопросов: {quest_count} 🔹 Количество правильных ответов: {quest_true} 🔹 Количество вопросов по {extra_cat}: {extra_quest_count} 🔹 Количество правильных ответов: {extra_quest_true} 🔹 Общее количество правильных ответов: {all_true} 📈 % ---- {percent} %

source: ✅ Иштирокингиз учун катта рахмат
de: ✅ Ishtirokingiz uchun katta raxmat
ru: ✅ Спасибо за ваше участие

source: Телефон рақамингизни +998 ** *** ** ** шаклда юборинг, ёки "📱 Рақам юбориш" тугмасини босинг:
ru: Отправьте свой номер телефона в формате +998 ** *** ** **, или нажмите кнопку "📱 Отправить номер"

source: ❌ Фамилия, Исм, Шариф хато киритилди ✅ Алийев Али Алийевич ✍🏼 Фамилия, Исм, Шарифингизни қайтадан киритинг.
de: ❌ Familiya, Ism, Sharif xato kiritildi ✅ Aliyev Ali Aliyevich ✍🏼 Familiya, Ism, Sharifingizni qaytadan kiriting.
ru: ❌ Фамилия, Имя, Отчество введены неправильно ✅ Алийев Али Алийевич ✍🏼 Введите Фамилия, Имя, Отчество снова.

source: 📝 Анкетангиз: 👤 ФИО: {name} 📲 Телефон: {phone} 📆 Ёшингиз: {age} 📚 Маълумотингиз: {educ} 📚 Дастурлаш тили: {prog_lang} 🖥 Кошимча маьлумотлар: {add_info} 📰 Резюмеингиз: {file_name}
de: 📝 Anketangiz: 👤 FIO: {name} 📲 Telefon: {phone} 📆 Yoshingiz: {age} 📚 Ma'lumotingiz: {educ} 📚 Dasturlash tili: {prog_lang} 🖥 Qo'shimcha ma'lumotlar: {add_info} 📰 Resyumeingiz: {file_name}
ru: 📝 Ваша анкета: 👤 Фио: {name} 📲 Телефон: {phone} 📆 Ваш возраст: {age} 📚 Ваше образование: {educ} 📚 Язык программирования: {prog_lang} 🖥 Дополнительные навыки: {add_info} 📰 Ваше резюме: {file_name}

source: ✍🏼 Фамилия, Исм, Шарифни киритинг.
de: ✍🏼 Familiya, Ism, Sharifni kiriting
ru: ✍🏼 Введите Фамилию, Имя, Отчество

source: Эркак
de: Erkak
ru: Мужчина

source: Аёл
de: Ayol
ru: Женщина

source: 🔙 Оркага
de: 🔙 Orqaga
ru: 🔙 Назад

source: Ўрта
de: O'rta
ru: Среднее

source: Ўрта махсус
de: O'rta maxsus
ru: Среднее-специальное

source: Олий тугалланмаган
de: Oliy tugallanmagan
ru: Незаконченное высшее

source: Олий
de: Oliy
ru: Высшее

source: ♻️Кайта тузиш
de: ♻️ Qayta tuzish
ru: ♻️ Составить заново

source: ✅Тасдиклаш
de: ✅ Tasdiqlash
ru: ✅ Подтвердить

source: Анкетани кайта тузиш
de: Anketani qayta tuzish
ru: Составить анкету заново

source: 🔄 Анкетани кайта тузиш
ru: 🔄 Составить анкету заново

source: ▶️ Тестни бошлаш
ru: ▶️ Начать тестирование

source: ✖️ Бекор килиш
de: ✖️ Bekor qilish
ru: ✖️ Отменить

source: Тестни бошлаш
de: Testni boshlash
ru: Начать тестирование

source: 🇺🇿 Тилни ўзагртириш 🇷🇺
ru: 🇺🇿 Сменить язык 🇷🇺

source: 📱 Рақам юбориш
de: 📱 Raqam yuborish
ru: 📱 Отправить номер

source: Қайси дастурлаш тили бўйича ўз фаолиятингизни юритишни истайсиз ?
de: Qaysi dasturlash tili bo'yicha o'z faoliyatingizni yuritishni istaysiz?

source: Телефон рақамингизни +998********* шаклда юборинг, ёки "📱 Рақам юбориш" тугмасини босинг:
de: Telefon raqamingizni +998********* shaklda yuboring, yoki "📱 Raqam yuborish" tugmasini bosing

source: {prog_lang} бойича саволлар сони: {quest_count} Тогри топилган жавоблар сони: {quest_true} Тест натижалари жонатилди, мутахассислар жавобини кутинг
de: {prog_lang} bo'yicha savollar soni: {quest_count} To'g'ri topilgan javoblar soni: {quest_true} Test natijalari jo'natildi, mutaxassis javobini kuting

source: {prog_lang} бойича саволлар сони: {quest_count} Тогри топилган жавоблар сони: {quest_true} {extra_cat} бойича саволлар сони: {extra_quest_count} Тогри топилган жавоблар сони: {extra_quest_true} Тест натижалари жонатилди, мутахассислар жавобини кутинг
de: {prog_lang} bo'yicha savollar soni: {quest_count} To'g'ri topilgan javoblar soni: {quest_true} {extra_cat} bo'yicha savollar soni: {extra_quest_count} To'g'ri topilgan javoblar soni: {extra_quest_true} Test natijalari jo'natildi, mutaxassis javobini kuting

source: ❌ Телефон рақамингиз нотўғри форматда киритилган. ☝️ Тeлeфон рақамингизни +9989** *** ** ** шаклда юборинг, ёки "📱 Рақам юбориш" тугмасини босинг:
de: ❌ Telefon raqamingiz noto'g'ri formatda kiritilgan. ☝️ Telefon raqamingizni +998********* shaklda yuboring, yoki "📱 Raqam yuborish" tugmasini bosing

source: Магистр
de: Magistr
